In [11]:
import pandas as pd
from pathlib import Path
from pandas import DataFrame
import datetime as dt

In [12]:
csv_path = Path("NASDAQ_Composite_2011-2021.csv")
df = pd.read_csv(csv_path, parse_dates=True, infer_datetime_format=True)
df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2011-01-03,2676.649902,2704.860107,2676.340088,2691.520020,2691.520020,1919660000
1,2011-01-04,2699.860107,2700.879883,2663.639893,2681.250000,2681.250000,2015440000
2,2011-01-05,2673.909912,2702.199951,2671.889893,2702.199951,2702.199951,2060750000
3,2011-01-06,2704.379883,2712.350098,2697.729980,2709.889893,2709.889893,2095490000
4,2011-01-07,2712.750000,2715.959961,2676.360107,2703.169922,2703.169922,1976220000

In [13]:
df.dtypes

Date          object
Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume         int64
dtype: object

In [14]:
df_2=df.rename({'Adj Close':'Nasdaq'})
df.drop(columns=['Open', 'High', 'Low', 'Close', 'Volume'], inplace=True)
df.head()

         Date    Adj Close
0  2011-01-03  2691.520020
1  2011-01-04  2681.250000
2  2011-01-05  2702.199951
3  2011-01-06  2709.889893
4  2011-01-07  2703.169922

In [16]:
df_2=df.rename({'Adj Close':'Nasdaq'}, axis=1)
df_2

            Date        Nasdaq
0     2011-01-03   2691.520020
1     2011-01-04   2681.250000
2     2011-01-05   2702.199951
3     2011-01-06   2709.889893
4     2011-01-07   2703.169922
...          ...           ...
2763  2021-12-23  15653.370117
2764  2021-12-27  15871.259766
2765  2021-12-28  15781.719727
2766  2021-12-29  15766.219727
2767  2021-12-30  15741.559570

[2768 rows x 2 columns]

In [17]:
df_2.isnull().sum()

Date      0
Nasdaq    0
dtype: int64

In [18]:
df_2.duplicated().sum()

0

In [19]:
nasdaq_11=df_2

In [20]:
nasdaq_11.head()

         Date       Nasdaq
0  2011-01-03  2691.520020
1  2011-01-04  2681.250000
2  2011-01-05  2702.199951
3  2011-01-06  2709.889893
4  2011-01-07  2703.169922

In [21]:
nasdaq_11.to_csv("nasdaq_11_cleaned.csv", index=False)